src/cf/InformationRegisters/desОчередьВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>desОчередьВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщенияОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/desОчередьВходящихСообщений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс


Процедура ЗарегистрироватьЗапрос(СтруктураЗапроса) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса.Сообщение);
	
	ЗапросJSON = ЗаписьJSON.Закрыть();
	
	// ++ VOG Солодов В.В. 07.10.2021
	ОтключитьОбработку 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураЗапроса, "ОтключитьОбработку", Ложь);
	Идентификатор 		= Неопределено;
	
	Если Не СтруктураЗапроса.Свойство("Идентификатор" , Идентификатор) Тогда
		// -- VOG Солодов В.В. 07.10.2021
		ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
		ХешированиеДанных.Добавить(ЗапросJSON);
		Идентификатор = НРег(СтрЗаменить(Строка(ХешированиеДанных.ХешСумма), " ", ""));
		
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторНастройки	= СтруктураЗапроса.ИдентификаторНастройки;
	МенеджерЗаписи.ИмяОчереди				= СтруктураЗапроса.ИмяОчереди;
	МенеджерЗаписи.Идентификатор 			= Идентификатор;
	МенеджерЗаписи.ДатаРегистрации 			= ТекущаяУниверсальнаяДата();
	МенеджерЗаписи.Хранилище = Новый ХранилищеЗначения(СтруктураЗапроса.Сообщение);
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не ОтключитьОбработку Тогда // ++ VOG Солодов В.В. 07.10.2021 // Добавлено условие
		
		СтруктураПараметров = Новый Структура("ИдентификаторНастройки,ИмяОчереди,ИдентификаторСообщения", СтруктураЗапроса.ИдентификаторНастройки,СтруктураЗапроса.ИмяОчереди,Идентификатор);
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(СтруктураЗапроса.ИдентификаторНастройки);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтруктураЗапроса.ИмяОчереди;
		ПараметрыВыполнения.ОжидатьЗавершение	= 0;
		
		Результат = ДлительныеОперации.ВыполнитьВФоне("desОбменДаннымиВызовСервера.ОбработатьСообщениеОчереди",СтруктураПараметров,ПараметрыВыполнения);
		
		//desОбменДаннымиВызовСервера.ОбработатьСообщениеОчереди(СтруктураЗапроса.ИдентификаторНастройки,СтруктураЗапроса.ИмяОчереди,Идентификатор);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
